Repository: rodriguesrm/rsoft-auth
Catalog: src/RSoft.Auth.Application/Language/AppResource.*.resx
Languages: pt_br

# CREDENTIAL_ACTION_CREATE
source: create
pt_br: criação

# CREDENTIAL_ACTION_CREATE_PASSWORD
source: password
pt_br: senha

# CREDENTIAL_ACTION_RECOVERY
source: recovery
pt_br: recuperação

# CREDENTIAL_ACTION_RECOVERY_PASSWORD
source: new password
pt_br: nova senha

# CREDENTIAL_BUTTONL_LABEL_CREATE
source: Create Password
pt_br: Criar Senha

# CREDENTIAL_BUTTONL_LABEL_RECOVERY
source: Create New Password
pt_br: Criar Nova Senha

source: Credential Create
pt_br: Criação de Credenciais

# CREDENTIAL_DISCARD_MESSAGE
source: If you have not requested this operation, please disregard this email.
pt_br: Caso não tenha solicitado uma nova senha, desconsidere este e-mail.

# CREDENTIAL_FIRST_ACCESS_SUBJECT
source: First Access
pt_br: Primeiro Acesso

# CREDENTIAL_MAIL_BODY_OPEN_TEXT
source: Hi {USERNAME}, you requested {ACTION} for your access credential on {SERVICE_NAME}. Create an {ACTION_PASSWORD} access by clicking the button below.
pt_br: Olá {USERNAME}, você solicitou a {ACTION} de sua credencial de acesso no {SERVICE_NAME}. Crie uma {ACTION_PASSWORD} de acesso clicando no botão abaixo.

# CREDENTIAL_OR_ELSE_LINK
source: Or if you prefer, you can access the link:
pt_br: Ou se preferir, você pode acessar o link:

source: Credential Recovery
pt_br: Recuperação de Credenciais

# CREDENTIAL_RECOVERY_ACCESS_SUBJECT
source: Recovery Credential
pt_br: Recuperação de Credenciais

# CREDENTIAL_TOKEN_DEADLINE
source: Remembering that the link above is valid until
pt_br: Lembrando que o link acima é valido até

# DOC_ALREADY_EXISTS
source: Document already exists
pt_br: Documento já existe

# DUPLICATED_ROLE_LIST
source: Duplicated roles in list
pt_br: Função duplicada na lista

# EMAIL_INVALID_OR_EMPTY
source: E-mail is invalid or empty
pt_br: E-mail é inválido ou vazio

# INVALID_LAYOUT
source: Layout is invalid
pt_br: A linha está em um layout inválido

# INVALID_ROLE
source: Role invalid or empty
pt_br: Função inválida ou vazia

# LINE_EMPTY
source: Line is empty
pt_br: A linha está vazia

# LOGIN_REQUIRED
source: Login is required
pt_br: O login deve ser informado

# ROLE_LIST_REQUIRED
source: The list of roles (id) is required
pt_br: A lista de funções (id) é requerida

source: Role not found
pt_br: Função não encontrada

# SERVICE_NOT_AS_USER
source: Service user cannot authenticate as a regular user
pt_br: O usuário do serviço não pode se autenticar como um usuário normal

# USER_INACTIVE
source: Inactive or blocked user
pt_br: O usuário está inativo/bloqueado

# USER_LOCKOUT
source: User is locked out
pt_br: O usuário está temporariamente bloqueado

source: User must change password
pt_br: O usuário deve alterar a senha

source: User not found
pt_br: Usuário não encontrado

# USER_PASSWORD_FAIL
source: Invalid username and/or password
pt_br: Usuário e/ou senha inválido(s)
